In [21]:
import pandas as pd
import numpy as np#construct data from the data

In [22]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [23]:
df=pd.DataFrame(data,index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [24]:
df

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [25]:
#find the shape data frame
df.shape

(10, 4)

In [9]:
#find the data types
df.dtypes

birds        object
age         float64
visits        int64
priority     object
dtype: object

In [10]:
#find the summary of information of data
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [11]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

In [13]:
#print the first 3 rows of the data
df.head(3)

     birds  age  visits priority
a   Cranes  3.5       2      yes
b   Cranes  4.0       4      yes
c  plovers  1.5       3       no

In [14]:
df.tail(3)

        birds  age  visits priority
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [15]:
#finding the missing value cound
df.isnull().sum()

birds       0
age         2
visits      0
priority    0
dtype: int64

In [22]:
#find the null value of age value
df['age'].isnull().value_counts()

False    8
True     2
Name: age, dtype: int64

In [24]:
#print the rows with age and name coloumn
df[["age","birds"]]

   age       birds
a  3.5      Cranes
b  4.0      Cranes
c  1.5     plovers
d  NaN  spoonbills
e  6.0  spoonbills
f  3.0      Cranes
g  5.5     plovers
h  NaN      Cranes
i  8.0  spoonbills
j  4.0  spoonbills

In [34]:
#select 2,3,7 and rows visit birds age
df.iloc[[2,3,7],[0,1,2]]

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

In [37]:
#select the rows number of visit less than 4
df[df['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [38]:
#select the rows with column birsds visits where age is missing
#select the rows where age is b/w inclusive 2 and 4
#find the number of each type of bird in the data frame

In [60]:
df[df['age'].isnull()][['birds','visits']]

        birds  visits
d  spoonbills       4
h      Cranes       2

In [72]:
#select the rows where age is b/w inclusive 2 and 4
df[(df['age']>=2)&(df['age']<=4)]

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

In [75]:
#find the number of each type of bird in the data frame
df['birds'].value_counts()

Cranes        4
spoonbills    4
plovers       2
Name: birds, dtype: int64

In [19]:
df.dropna() #remove the na values

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

In [48]:
#select the birds who visits less tha 4 times
df[["birds","visits"]][(df["visits"]<=4)]

        birds  visits
a      Cranes       2
b      Cranes       4
c     plovers       3
d  spoonbills       4
e  spoonbills       3
f      Cranes       4
g     plovers       2
h      Cranes       2
i  spoonbills       3
j  spoonbills       2

In [26]:
#visit >2 age>2 pick this birds

df[["birds"]][(df['visits']>2)&(df['age']<4)]

     birds
c  plovers
f   Cranes

In [32]:
#age and type of birds with maximum visits

a=df["visits"].max()
df[["birds","age"]][df["visits"]==a]

        birds  age
b      Cranes  4.0
d  spoonbills  NaN
f      Cranes  3.0